src/main/resources/xmlsabng/request-entitlement-template.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <samlp:AttributeQuery xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
      xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" ID="aaf23196-1773-2113-474a-fe114412ab72"
      Version="2.0" IssueInstant="2012-12-13T16:34:40Z">
      <saml:Issuer Format="urn:oasis:names:tc:SAML:2.0:nameid-format:entity">{0}</saml:Issuer>
      <saml:Subject>
        <saml:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:unspecified">{1}</saml:NameID>
      </saml:Subject>
      <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
        Name="urn:oid:1.3.6.1.4.1.5923.1.1.1.7" FriendlyName="entitlements">
      </saml:Attribute>
    </samlp:AttributeQuery>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>